In [0]:
import numpy as np
import pandas as pd

## object creation

In [3]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
d=pd.date_range('20130101',periods=6)
d
df=pd.DataFrame(np.random.randn(6,4),index=d,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.763055  0.232062  0.779666  0.640516
2013-01-02 -0.618279  0.689766 -1.473013  0.807873
2013-01-03  0.535734  1.885526 -0.460454  0.602638
2013-01-04 -0.630800  1.700747  0.040570 -0.355759
2013-01-05  0.534841  0.253689  0.877194 -0.265996
2013-01-06  0.619902 -0.978367  0.048517  0.019765

In [11]:
df2=pd.DataFrame({'A':pd.Timestamp(20130102),'B':pd.Series(1,index=list(range(4)),dtype='float32'),'C':np.array([3]*4,dtype='int32'),'D':1.,'E':pd.Categorical(["test","train","test","train"]),'F':'foo'})
df2

                              A    B  C    D      E    F
0 1970-01-01 00:00:00.020130102  1.0  3  1.0   test  foo
1 1970-01-01 00:00:00.020130102  1.0  3  1.0  train  foo
2 1970-01-01 00:00:00.020130102  1.0  3  1.0   test  foo
3 1970-01-01 00:00:00.020130102  1.0  3  1.0  train  foo

In [12]:
df2.dtypes

A    datetime64[ns]
B           float32
C             int32
D           float64
E          category
F            object
dtype: object

## viewing data

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

to_numpy will be relatively expensive for dataframe with multiple datatypes

In [16]:
df.T  #TRANSPOSING

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.763055   -0.618279    0.535734   -0.630800    0.534841    0.619902
B    0.232062    0.689766    1.885526    1.700747    0.253689   -0.978367
C    0.779666   -1.473013   -0.460454    0.040570    0.877194    0.048517
D    0.640516    0.807873    0.602638   -0.355759   -0.265996    0.019765

In [17]:
#SORTING BY AN AXIS
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  0.640516  0.779666  0.232062  0.763055
2013-01-02  0.807873 -1.473013  0.689766 -0.618279
2013-01-03  0.602638 -0.460454  1.885526  0.535734
2013-01-04 -0.355759  0.040570  1.700747 -0.630800
2013-01-05 -0.265996  0.877194  0.253689  0.534841
2013-01-06  0.019765  0.048517 -0.978367  0.619902

In [18]:
#SORTING BY VALUES
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  0.619902 -0.978367  0.048517  0.019765
2013-01-01  0.763055  0.232062  0.779666  0.640516
2013-01-05  0.534841  0.253689  0.877194 -0.265996
2013-01-02 -0.618279  0.689766 -1.473013  0.807873
2013-01-04 -0.630800  1.700747  0.040570 -0.355759
2013-01-03  0.535734  1.885526 -0.460454  0.602638

## selection

In [19]:
df.loc[d[0]]

A    0.763055
B    0.232062
C    0.779666
D    0.640516
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.at[d[0],'A']

0.7630553297875069

In [22]:
df.iloc[3]

A   -0.630800
B    1.700747
C    0.040570
D   -0.355759
Name: 2013-01-04 00:00:00, dtype: float64

In [23]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.630800  1.700747
2013-01-05  0.534841  0.253689

In [24]:
df.iat[1,1]

0.6897664622120568

## boolean

In [25]:
df2

                              A    B  C    D      E    F
0 1970-01-01 00:00:00.020130102  1.0  3  1.0   test  foo
1 1970-01-01 00:00:00.020130102  1.0  3  1.0  train  foo
2 1970-01-01 00:00:00.020130102  1.0  3  1.0   test  foo
3 1970-01-01 00:00:00.020130102  1.0  3  1.0  train  foo

In [29]:
df2=df.copy()
df2
df2['E']=['one','one','two','three','four','three']
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.535734  1.885526 -0.460454  0.602638   two
2013-01-05  0.534841  0.253689  0.877194 -0.265996  four

In [33]:
len(df)
df.loc[:,'D']=np.array([5]*len(df))
df2

                   A         B         C         D      E
2013-01-01  0.763055  0.232062  0.779666  0.640516    one
2013-01-02 -0.618279  0.689766 -1.473013  0.807873    one
2013-01-03  0.535734  1.885526 -0.460454  0.602638    two
2013-01-04 -0.630800  1.700747  0.040570 -0.355759  three
2013-01-05  0.534841  0.253689  0.877194 -0.265996   four
2013-01-06  0.619902 -0.978367  0.048517  0.019765  three

In [34]:
df2=df.copy()
df2[df2>0]=-df2
df2

                   A         B         C  D
2013-01-01 -0.763055 -0.232062 -0.779666 -5
2013-01-02 -0.618279 -0.689766 -1.473013 -5
2013-01-03 -0.535734 -1.885526 -0.460454 -5
2013-01-04 -0.630800 -1.700747 -0.040570 -5
2013-01-05 -0.534841 -0.253689 -0.877194 -5
2013-01-06 -0.619902 -0.978367 -0.048517 -5

## missing data

In [39]:
df1=df.reindex(index=d[0:4],columns=list(df.columns)+['E'])
df1.loc[d[0]:d[1],'E']=1
df1

                   A         B         C  D    E
2013-01-01  0.763055  0.232062  0.779666  5  1.0
2013-01-02 -0.618279  0.689766 -1.473013  5  1.0
2013-01-03  0.535734  1.885526 -0.460454  5  NaN
2013-01-04 -0.630800  1.700747  0.040570  5  NaN

In [40]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.763055  0.232062  0.779666  5  1.0
2013-01-02 -0.618279  0.689766 -1.473013  5  1.0

In [41]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.763055  0.232062  0.779666  5  1.0
2013-01-02 -0.618279  0.689766 -1.473013  5  1.0
2013-01-03  0.535734  1.885526 -0.460454  5  5.0
2013-01-04 -0.630800  1.700747  0.040570  5  5.0

In [42]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

## operations

In [49]:
df.mean()

A    0.200742
B    0.630570
C   -0.031253
D    5.000000
dtype: float64

In [50]:
df.mean(1)

2013-01-01    1.693696
2013-01-02    0.899619
2013-01-03    1.740201
2013-01-04    1.527629
2013-01-05    1.666431
2013-01-06    1.172513
Freq: D, dtype: float64

In [51]:
df.apply(np.cumsum)  #cumulative summing

                   A         B         C   D
2013-01-01  0.763055  0.232062  0.779666   5
2013-01-02  0.144776  0.921828 -0.693347  10
2013-01-03  0.680510  2.807354 -1.153801  15
2013-01-04  0.049710  4.508101 -1.113231  20
2013-01-05  0.584551  4.761790 -0.236037  25
2013-01-06  1.204452  3.783422 -0.187519  30

## histogramming

In [52]:
s=pd.Series(np.random.randint(0,7,size=10))
s.value_counts()

0    3
5    2
3    2
6    1
4    1
1    1
dtype: int64

## string

In [53]:
s=pd.Series(['A','B','C','AaBa',np.nan])
s.str.lower()

0       a
1       b
2       c
3    aaba
4     NaN
dtype: object

## merge

In [55]:
df=pd.DataFrame(np.random.randn(10,4))
pieces=[df[:3],df[3:7],df[7:]]
pd.concat(pieces)

          0         1         2         3
0  0.478548 -0.252558 -0.589660  0.278770
1 -0.356297 -0.809042  0.325282  0.526571
2  1.372351  0.360141  0.684331  0.940532
3  0.795334  0.272722 -0.745089 -0.226146
4  0.760438 -0.236181  0.542389  0.473278
5  0.736510 -1.083833 -0.350918  0.711099
6 -0.992729  0.411755  0.039852  0.744290
7 -0.128079  0.688296 -1.816034  1.244108
8 -1.910052  0.932874 -2.057844  0.355458
9  0.021996 -0.108095  0.157351  0.509619

## join

In [58]:
left=pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})
right=pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## groupby

In [64]:
df=pd.DataFrame({'A':['foo','foo','foof'],'B':[1,2,3]})
df

      A  B
0   foo  1
1   foo  2
2  foof  3

In [67]:
df.groupby('A').sum()

      B
A
foo   3
foof  3

In [68]:
df.groupby(['A','B']).sum()

Empty DataFrame
Columns: []
Index: [(foo, 1), (foo, 2), (foof, 3)]

## reshaping

In [70]:
df1

                   A         B         C  D    E
2013-01-01  0.763055  0.232062  0.779666  5  1.0
2013-01-02 -0.618279  0.689766 -1.473013  5  1.0
2013-01-03  0.535734  1.885526 -0.460454  5  NaN
2013-01-04 -0.630800  1.700747  0.040570  5  NaN

In [71]:
st=df1.stack()
st

2013-01-01  A    0.763055
            B    0.232062
            C    0.779666
            D    5.000000
            E    1.000000
2013-01-02  A   -0.618279
            B    0.689766
            C   -1.473013
            D    5.000000
            E    1.000000
2013-01-03  A    0.535734
            B    1.885526
            C   -0.460454
            D    5.000000
2013-01-04  A   -0.630800
            B    1.700747
            C    0.040570
            D    5.000000
dtype: float64

## categorical

In [74]:
df=pd.DataFrame({'id':[1,2,3,4,5,6],"raw_grade":['a','b','c','d','e','f']})
df

   id raw_grade
0   1         a
1   2         b
2   3         c
3   4         d
4   5         e
5   6         f

In [75]:
df["grade"]=df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    c
3    d
4    e
5    f
Name: grade, dtype: category
Categories (6, object): [a, b, c, d, e, f]